{"Türkiye": "Türkiye, küresel ısınma ile mücadelede aktif bir rol üstlenmiş ve çeşitli alanlarda çalışmalar gerçekleştirmiştir. Bunlar arasında, ulusal düzeyde iklim değişikliği politikalarının oluşturulması ve uygulanması, enerji sektöründe yenilenebilir enerji kaynaklarına daha fazla yatırım yapılması, enerji verimliliğinin artırılması için çeşitli teşviklerin ve projelerin hayata geçirilmesi bulunmaktadır. Ayrıca, ormansızlaşmanın önlenmesi amacıyla ağaçlandırma ve erozyonla mücadele gibi projeler yürütülmekte, tarım alanlarında verimliliği artırmak için sürdürülebilir tarım uygulamaları teşvik edilmektedir."
, "ABD": "ABD, küresel ısınma ve çevre kirliliği konusunda bir dizi önlem almıştır. Bunlar arasında temiz enerjiye geçişin teşvik edilmesi önemli bir adımdır. Yenilenebilir enerji kaynaklarına yönelik teşvikler, federal düzeydeki politikalar ve yerel düzeydeki inisiyatiflerle desteklenmiştir. Ayrıca, sera gazı emisyonlarını azaltmak amacıyla endüstriyel tesisler ve taşıtlar için daha sıkı emisyon standartları belirlenmiştir.ABD ayrıca, Paris İklim Anlaşması'na yeniden katılarak küresel çapta iklim değişikliği ile mücadeleye destek vermiştir. Bu çerçevede, karbon emisyonlarının azaltılması için ulusal hedefler belirlenmiş ve bu hedeflere ulaşmak için çeşitli politika ve programlar başlatılmıştır. Ülke genelinde, çevre dostu teknolojilerin ve sürdürülebilir uygulamaların teşviki için teşvikler ve vergi indirimleri gibi ekonomik önlemler de alınmıştır.",
 "Çin": "Çin, küresel ısınma ve çevre kirliliği konusunda kapsamlı önlemler almıştır. Ülke, dünyanın en büyük sera gazı emisyonlarına sahip olmasına rağmen, bu sorunla mücadelede kararlı adımlar atmıştır. Yenilenebilir enerji kaynaklarına yatırım yapma konusunda öncü bir rol üstlenmiş ve dünyanın en büyük yenilenebilir enerji üreticisi haline gelmiştir. Çin'in karbon emisyonlarını azaltmaya yönelik politikaları arasında, fosil yakıt kullanımını azaltmayı ve temiz enerji kaynaklarını geliştirmeyi hedefleyen planlar bulunmaktadır. Ülke, karbon ticareti sistemleri gibi ekonomik araçlarla emisyonları kontrol altında tutmaya çalışmaktadır. Ayrıca, çevre dostu teknolojilerin geliştirilmesi ve kullanımının teşvik edilmesi amacıyla araştırma ve geliştirme faaliyetlerine büyük yatırımlar yapılmaktadır."}